# TODO  Напишите функцию count_letters
def count_letters(text):
    count = 0
    total = 0
    vocabulary = {}
    alphabet = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
    text = text.lower()
    for symbol in alphabet:
        for letter in text:
            if letter == symbol:
                count += 1
        if count != 0:
            vocabulary[symbol] = count
            total += count
            count = 0
    return vocabulary, total

# TODO Напишите функцию calculate_frequency
def calculate_frequency(vocabulary, total):
    for symbol in vocabulary:
        vocabulary[symbol] /= total
    return vocabulary


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

# TODO Распечатайте в столбик букву и её частоту в тексте
vocabulary, total = count_letters(main_str)
vocab = calculate_frequency(vocabulary, total)
for symbol in vocab:
    print(symbol, round(vocab[symbol], 2))